Revit 2027 API
Document.SiteLocation Property
Returns the site location information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SiteLocation SiteLocation { get; }
Public ReadOnly Property SiteLocation As SiteLocation
	Get
public:
property SiteLocation^ SiteLocation {
	SiteLocation^ get ();
}
member SiteLocation : SiteLocation with get
Property Value
SiteLocation
Remarks
The SiteLocation property returns an object that contains the site location for the entire project.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace